#pragma once
#include "GameObject.h"

namespace Sexy {
	class Graphics;
}

// An object class for rendering visuals
class RealObject : public GameObject, public Renderable
{
public:
	using Renderable::Draw;

	Sexy::SexyVector3 m_position;
	int m_teamFlags;
	int m_realObjectFlags;

	virtual void UpdatePosition(Sexy::SexyVector3& newPos) {};
	virtual void QueueDraw(Sexy::Graphics* g) {};
	virtual void Draw(Sexy::Graphics* g) {};
	virtual bool HasShadow() { return {}; };
	virtual void Function17() {};
	virtual bool CanSink() { return {}; };
	virtual void UpdateSinkDistance(bool noOverride) {}; // override a deeper sink distance with a more shallow one
	virtual Sexy::Rect GetHitRect() { return {}; };
	virtual void Function21() {};
	virtual void Function22() {};
	virtual int GetRenderOrder() { return {}; };
	virtual Sexy::FPoint GetGridExtents() { return {}; };
	virtual void Function25() {};
	virtual void Function26() {};
	virtual void RenderAnimRigs(Sexy::Graphics* g) {};
	virtual void RenderShadows(Sexy::Graphics* g) {};
	virtual void Update() {}; // runs every frame
	virtual void UpdateGroundClipRect(Sexy::Graphics* graphics) {}; // uses to clip the ground for ground effects
	virtual float GetMaxTideLoweredPercent() { return {}; };
	virtual float GetSinkDistance() { return {}; };
};

static_assert(sizeof(RealObject) == 48);
static_assert(offsetof(RealObject, m_position) == 24);
static_assert(offsetof(RealObject, m_realObjectFlags) == 40);

// RealObject that supports color effects
class ModularRealObject : public RealObject
{
public:
	void* m_attachedEffects;
	char pad[24];

	virtual void Function33() {};
	virtual void Function34() {};
};

static_assert(sizeof(ModularRealObject) == 80);
static_assert(offsetof(ModularRealObject, m_attachedEffects) == 48);